---
kind: method
id: M:Autodesk.Revit.DB.TextRange.Dispose
source: html/7abafd9d-c703-75f5-cf79-e1e4dcccf409.htm
---
# Autodesk.Revit.DB.TextRange.Dispose Method

Releases all resources used by the TextRange

## Syntax (C#)
```csharp
public void Dispose()
```